Repository: cybojanek/dm-mintegrity
Catalog: cryptsetup-1.6.2/po/*.po
Languages: pl

source: The cipher used to encrypt the disk (see /proc/crypto)
pl: Szyfr u¿ywany do zaszyfrowania dysku (p. /proc/crypto)

source: The hash used to create the encryption key from the passphrase
pl: Skrót u¿ywany do utworzenia klucza szyfruj±cego z has³a

source: Verifies the passphrase by asking for it twice
pl: Sprawdzenie poprawno¶ci has³a poprzez dwukrotne pytanie

source: Read the key from a file.
pl: Odczyt klucza z pliku.

source: Read the volume (master) key from file.
pl: Odczyt klucza wolumenu (klucza g³ównego) z pliku.

source: Dump volume (master) key instead of keyslots info.
pl: Zrzut (g³ównego) klucza wolumenu zamiast informacji o kluczach.

source: The size of the encryption key
pl: Rozmiar klucza szyfruj±cego

source: BITS
pl: BITÓW

source: Limits the read from keyfile
pl: Ograniczenie odczytu z pliku klucza

source: bytes
pl: bajty

source: Number of bytes to skip in keyfile
pl: Liczba bajtów do pominiêcia w pliku klucza

source: Limits the read from newly added keyfile
pl: Ograniczenie odczytu z nowo dodanego pliku klucza

source: Number of bytes to skip in newly added keyfile
pl: Liczba bajtów do pominiêcia w nowo dodanym kluczu

source: Slot number for new key (default is first free)
pl: Numer dla nowego klucza (domy¶lny: pierwszy wolny)

source: The size of the device
pl: Rozmiar urz±dzenia

source: SECTORS
pl: SEKTORÓW

source: The start offset in the backend device
pl: Offset pocz±tku na urz±dzeniu przechowuj±cym

source: How many sectors of the encrypted data to skip at the beginning
pl: Liczba sektorów zaszyfrowanych danych do pominiêcia

source: Create a readonly mapping
pl: Utworzenie odwzorowania tylko do odczytu

source: PBKDF2 iteration time for LUKS (in ms)
pl: Czas iteracji PBKDF2 dla LUKS (w milisekundach)

source: msecs
pl: ms

source: Do not ask for confirmation
pl: Bez pytañ o potwierdzenie

source: Timeout for interactive passphrase prompt (in seconds)
pl: Limit czasu przy interaktywnym pytaniu o has³o (w sekundach)

source: secs
pl: s

source: How often the input of the passphrase can be retried
pl: Jak czêsto mo¿na powtarzaæ próby wprowadzenia has³a

source: Align payload at <n> sector boundaries - for luksFormat
pl: Wyrównanie danych do granicy <n> sektorów - dla luksFormat

source: File with LUKS header and keyslots backup.
pl: Plik z kopi± zapasow± nag³ówka LUKS i kluczy.

source: Use /dev/random for generating volume key.
pl: U¿ycie /dev/random do wygenerowania klucza wolumenu.

source: Use /dev/urandom for generating volume key.
pl: U¿ycie /dev/urandom do wygenerowania klucza wolumenu.

source: Share device with another non-overlapping crypt segment.
pl: Wspó³dzielenie urz±dzenia z innym, nie zachodz±cym segmentem szyfrowanym.

source: UUID for device to use.
pl: UUID dla urz±dzenia, które ma byæ u¿yte.

source: Allow discards (aka TRIM) requests for device.
pl: Zezwolenie na ¿±dania porzucenia (TRIM) dla urz±dzenia.

source: Device or file with separated LUKS header.
pl: Urz±dzenie lub plik z osobnym nag³ówkiem LUKS.

source: Do not activate device, just check passphrase.
pl: Sprawdzenie has³a bez uaktywniania urz±dzenia.

source: Use hidden header (hidden TCRYPT device).
pl: U¿ycie nag³ówka ukrytego (ukrytego urz±dzenia TCRYPT).

source: Device is system TCRYPT drive (with bootloader).
pl: Urz±dzenie jest napêdem systemowym TCRYPT (z bootloaderem).

source: Type of device metadata: luks, plain, loopaes, tcrypt.
pl: Typ metadanych urz±dzenia: luks, plain, loopaes, tcrypt.

source: Disable password quality check (if enabled).
pl: Wy³±czenie sprawdzania jako¶ci has³a (je¶li w³±czone).

source: [OPTION...] <action> <action-specific>
pl: [OPCJA...] <akcja> <parametry-akcji>

source: Argument <action> missing.
pl: Brak argumentu <akcja>.

source: Unknown action.
pl: Nieznana akcja.

source: Option --shared is allowed only for open of plain device.
pl: Opcja --shared jest dozwolona tylko dla operacji otwarcia zwyk³ego urz±dzenia.

source: Option --allow-discards is allowed only for open operation.
pl: Opcja --allow-discards jest dozwolona tylko dla operacji otwarcia.

source: Option --key-size is allowed only for luksFormat, open and benchmark. To limit read from keyfile use --keyfile-size=(bytes).
pl: Opcja --key-size jest dopuszczalna tylko dla operacji luksFormat, open i benchmark. Aby ograniczyæ odczyt z pliku klucza, nale¿y u¿yæ --keyfile-size=(bajty).

source: Option --test-passphrase is allowed only for open of LUKS and TCRYPT devices.
pl: Opcja --test-passphrase jest dozwolona tylko przy otwieraniu urz±dzeñ LUKS i TRCYPT.

source: Key size must be a multiple of 8 bits
pl: Rozmiar klucza musi byæ wielokrotno¶ci± 8 bitów

source: Key slot is invalid.
pl: Numer klucza jest nieprawid³owy.

source: Option --key-file takes precedence over specified key file argument.
pl: Opcja --key-file ma priorytet nad podanym argumentem pliku klucza.

source: Negative number for option not permitted.
pl: Liczba ujemna nie jest dozwolona dla tej opcji.

source: Only one of --use-[u]random options is allowed.
pl: Dozwolona jest tylko jedna z opcji --use-[u]random.

source: Option --use-[u]random is allowed only for luksFormat.
pl: Opcja --use-[u]random jest dozwolona tylko dla operacji luksFormat.

source: Option --uuid is allowed only for luksFormat and luksUUID.
pl: Opcja --uuid jest dozwolona tylko dla operacji luksFormat i luksUUID.

source: Option --align-payload is allowed only for luksFormat.
pl: Opcja --align-payload jest dozwolona tylko dla operacji luksFormat.

source: Option --skip is supported only for open of plain and loopaes devices.
pl: Opcja --skip jest obs³ugiwana tylko przy otwieraniu urz±dzeñ plain i loopaes.

source: Option --offset is supported only for open of plain and loopaes devices.
pl: Opcja --offset jest obs³ugiwana tylko przy otwieraniu urz±dzeñ plain i loopaes.

source: Option --tcrypt-hidden or --tcrypt-system is supported only for TCRYPT device.
pl: Opcje --tcrypt-hidden i --tcrypt-system s± obs³ugiwane tylko dla urz±dzeñ TCRYPT.

source: Invalid salt string specified.
pl: Podano b³êdny ³añcuch zarodka.

source: Cannot create hash image %s for writing.
pl: Nie mo¿na utworzyæ obrazu hasza %s do zapisu.

source: Invalid root hash string specified.
pl: Podano b³êdny ³añcuch g³ównego hasza.

source: <data_device> <hash_device>
pl: <urz±dzenie_danych> <urz±dzenie_haszy>

source: format device
pl: sformatowanie urz±dzenia

source: <data_device> <hash_device> <root_hash>
pl: <urz±dzenie_danych> <urz±dzenie_haszy> <g³ówny_hasz>

source: verify device
pl: weryfikacja urz±dzenia

source: <name> <data_device> <hash_device> <root_hash>
pl: <nazwa> <urz±dzenie_danych> <urz±dzenie_haszy> <g³ówny_hasz>

source: create active device
pl: utworzenie aktywnego urz±dzenia

source: remove (deactivate) device
pl: usuniêcie (deaktywacja) urz±dzenia

source: show active device status
pl: pokazanie stanu aktywnego urz±dzenia

source: <hash_device>
pl: <urz±dzenie_haszy>

source: show on-disk information
pl: wy¶wietlenie informacji z dysku

source: <name> is the device to create under %s <data_device> is the data device <hash_device> is the device containing verification data <root_hash> hash of the root node on <hash_device>
pl: <nazwa> to urz±dzenie do utworzenia pod %s <urz±dzenie_danych> to urz±dzenie z danymi <urz±dzenie_haszy> to urz±dzenie zawieraj±ce dane weryfikacyjne <g³ówny_hasz> to hasz g³ównego wêz³a na <urz±dzeniu_haszy>

source: Default compiled-in dm-verity parameters: Hash: %s, Data block (bytes): %u, Hash block (bytes): %u, Salt size: %u, Hash format: %u
pl: Domy¶lnie wkompilowane parametry dm-verity: Hasz: %s, blok danych (bajtów): %u, blok haszy (bajtów): %u, rozmiar zarodka: %u, format haszy: %u

source: Do not use verity superblock
pl: Nieu¿ywanie superbloku VERITY

source: Format type (1 - normal, 0 - original Chrome OS)
pl: Typ formatu (1 - normalny, 0 - oryginalny Chrome OS)

source: number
pl: liczba

source: Block size on the data device
pl: Rozmiar bloku na urz±dzeniu z danymi

source: Block size on the hash device
pl: Rozmiar bloku na urz±dzeniu z haszami

source: The number of blocks in the data file
pl: Liczba bloków w pliku danych

source: blocks
pl: bloki

source: Starting offset on the hash device
pl: Offset pocz±tku na urz±dzeniu z haszami

source: Hash algorithm
pl: Algorytm skrótu

source: string
pl: ³añcuch

source: Salt
pl: Zarodek

source: hex string
pl: £añcuch szesnastkowy

source: Cannot exclusively open %s, device in use.
pl: Nie mo¿na otworzyæ %s w trybie wy³±cznym, urz±dzenie jest w u¿yciu.

source: Cannot open device %s
pl: Nie mo¿na otworzyæ urz±dzenia %s

source: Allocation of aligned memory failed.
pl: Przydzielenie wyrównanego obszaru pamiêci nie powiod³o siê.

source: Cannot read device %s.
pl: Nie mo¿na odczytaæ urz±dzenia %s.

source: Marking LUKS device %s unusable.
pl: Oznaczanie urz±dzenia LUKS %s jako bezu¿ytecznego.

source: Marking LUKS device %s usable.
pl: Oznaczenie urz±dzenia LUKS %s jako u¿ytecznego.

source: Cannot write device %s.
pl: Nie mo¿na zapisaæ na urz±dzenie %s.

source: Cannot write reencryption log file.
pl: Nie mo¿na zapisaæ pliku logu ponownego szyfrowania.

source: Cannot read reencryption log file.
pl: Nie mo¿na odczytaæ pliku logu ponownego szyfrowania.

source: Log file %s exists, resuming reencryption.
pl: Plik logu %s istnieje, wznowienie ponownego szyfrowania.

source: Activating temporary device using old LUKS header.
pl: Aktywacja urz±dzenia tymczasowego przy u¿yciu starego nag³ówka LUKS.

source: Activating temporary device using new LUKS header.
pl: Aktywacja urz±dzenia tymczasowego przy u¿yciu nowego nag³ówka LUKS.

source: Activation of temporary devices failed.
pl: Aktywacja urz±dzeñ tymczasowych nie powiod³a siê.

source: New LUKS header for device %s created.
pl: Utworzono nowy nag³ówek LUKS dla urz±dzenia %s.

source: Activated keyslot %i.
pl: Uaktywniono klucz %i.

source: LUKS header backup of device %s created.
pl: Utworzono kopiê zapasow± nag³ówka LUKS urz±dzenia %s.

source: Creation of LUKS backup headers failed.
pl: Tworzenie kopii zapasowych nag³ówków LUKS nie powiod³o siê.

source: Cannot restore LUKS header on device %s.
pl: Nie mo¿na odtworzyæ nag³ówka LUKS na urz±dzeniu %s.

source: LUKS header on device %s restored.
pl: Odtworzono nag³ówek LUKS na urz±dzeniu %s.

source: Progress: %5.1f%%, ETA %02llu:%02llu, %4llu MiB written, speed %5.1f MiB/s%s
pl: Postêp: %5.1f%%, ETA %02llu:%02llu, zapisano %4llu MiB, szybko¶æ %5.1f MiB/s%s

source: Cannot seek to device offset.
pl: Nie mo¿na przemie¶ciæ siê we w³a¶ciwe po³o¿enie urz±dzenia.

source: Cannot open temporary LUKS header file.
pl: Nie mo¿na otworzyæ pliku tymczasowego nag³ówka LUKS.

source: Cannot get device size.
pl: Nie mo¿na pobraæ rozmiaru urz±dzenia.

source: Interrupted by a signal.
pl: Przerwano sygna³em.

source: IO error during reencryption.
pl: B³±d we/wy podczas ponownego szyfrowania.

source: Key file can be used only with --key-slot or with exactly one key slot active.
pl: Rozmiaru klucza mo¿na u¿yæ tylko z --key-slot albo przy dok³adnie jednym aktywnym kluczu.

source: Enter passphrase for key slot %u:
pl: Has³o dla klucza %u:

source: Cannot open reencryption log file.
pl: Nie mo¿na otworzyæ pliku logu ponownego szyfrowania.

source: Reencryption block size
pl: Rozmiar bloku ponownego szyfrowania

source: Use direct-io when accesing devices.
pl: U¿ycie bezpo¶redniego we/wy przy dostêpie do urz±dzeñ.

source: Use fsync after each block.
pl: U¿ycie fsync po ka¿dym bloku.

source: Update log file after every block.
pl: Uaktualnianie pliku logu po ka¿dym bloku.

source: Use only this slot (others will be disabled).
pl: U¿ycie tylko tego slotu (wy³±czenie pozosta³ych).

source: Reduce data device size (move data offset). DANGEROUS!
pl: Ograniczenie rozmiaru urz±dzenia danych (przesuniêcie po³o¿enia danych). NIEBEZPIECZNE!

source: Use only specified device size (ignore rest of device). DANGEROUS!
pl: U¿ycie tylko okre¶lonego rozmiaru urz±dzenia (zignorowanie pozosta³ej czê¶ci). NIEBEZPIECZNE!

source: Create new header on not encrypted device.
pl: Utworzenie nowego nag³ówka na nieszyfrowanym urz±dzeniu.

source: [OPTION...] <device>
pl: [OPCJA...] <urz±dzenie>

source: WARNING: this is experimental code, it can completely break your data.
pl: UWAGA: ten kod jest eksperymentalny, mo¿e ca³kowicie uszkodziæ dane.

source: Reencryption will change: volume key%s%s%s%s.
pl: Ponowne szyfrowanie zmieni: klucz wolumenu%s%s%s%s.

source: , set hash to
pl: , hasz na

source: , set cipher to
pl: , szyfr na

source: Argument required.
pl: Wymagany argument.

source: Only values between 1 MiB and 64 MiB allowed for reencryption block size.
pl: Jako rozmiar bloku ponownego szyfrowania dozwolone s± jedynie warto¶ci od 1 MiB do 64 MiB.

source: Invalid device size specification.
pl: B³êdne okre¶lenie rozmiaru urz±dzenia.

source: Maximum device reduce size is 64 MiB.
pl: Maksymalna warto¶æ ograniczenia rozmiaru urz±dzenia to 64MiB.

source: Reduce size must be multiple of 512 bytes sector.
pl: Rozmiar ograniczenia musi byæ wielokrotno¶ci± 512-bajtowego sektora.

source: Option --new must be used together with --reduce-device-size.
pl: Opcja --new musi byæ u¿yta wraz z --reduce_device_size.

source: Error reading response from terminal.
pl: B³±d podczas odczytu odpowiedzi z terminala.

source: Command successful.
pl: Polecenie siê powiod³o.

source: Command failed with code %i
pl: Polecenie nie powiod³o siê z kodem %i

source: Cannot check password quality: %s
pl: Nie mo¿na sprawdziæ jako¶ci has³a: %s

source: Password quality check failed: %s
pl: Sprawdzenie jako¶ci has³a nie powiod³o siê: %s
