Repository: cybojanek/dm-mintegrity
Catalog: cryptsetup-1.6.2/po/*.po
Languages: pl

source: Cannot initialize device-mapper, running as non-root user.
pl: Nie mo¿na zainicjowaæ device-mappera w czasie dzia³ania jako nie-root.

source: Cannot initialize device-mapper. Is dm_mod kernel module loaded?
pl: Nie mo¿na zainicjowaæ device-mappera. Czy modu³ j±dra dm_mod jest wczytany?

source: DM-UUID for device %s was truncated.
pl: DM-UUID dla urz±dzenia %s zosta³ skrócony.

source: System is out of entropy while generating volume key. Please move mouse or type some text in another window to gather some random events.
pl: Entropia w systemie wyczerpa³a siê w trakcie generowania klucza wolumenu. Proszê poruszaæ mysz± albo wpisaæ trochê tekstu w innym oknie w celu zebrania zdarzeñ losowych.

source: Generating key (%d%% done).
pl: Generowanie klucza (gotowe %d%%).

source: Fatal error during RNG initialisation.
pl: B³±d krytyczny w trakcie inicjalizacji RNG.

source: Unknown RNG quality requested.
pl: Nieznane ¿±danie jako¶ci RNG.

source: Error %d reading from RNG: %s
pl: B³±d %d podczas odczytu z RNG: %s

source: Cannot initialize crypto RNG backend.
pl: Nie mo¿na zainicjowaæ backendu kryptograficznego RNG.

source: Cannot initialize crypto backend.
pl: Nie mo¿na zainicjowaæ backendu kryptograficznego.

source: Hash algorithm %s not supported.
pl: Algorytm skrótu %s nie jest obs³ugiwany.

source: Key processing error (using hash %s).
pl: B³±d przetwarzania klucza (u¿yto algorytmu skrótu %s).

source: All key slots full.
pl: Wszyskie miejsca na klucze s± pe³ne.

source: Key slot %d is invalid, please select between 0 and %d.
pl: Numer klucza %d jest b³êdny, proszê wybraæ warto¶æ miêdzy 0 a %d.

source: Key slot %d is full, please select another one.
pl: Miejsce na klucz %d jest pe³ne, proszê wybraæ inne.

source: Enter passphrase for %s:
pl: Has³o dla %s:

source: Header detected but device %s is too small.
pl: Wykryto nag³ówek, ale urz±dzenie %s jest zbyt ma³e.

source: This operation is not supported for this device type.
pl: Ta operacja nie jest obs³ugiwana dla tego rodzaju urz±dzenia.

source: Device %s is not active.
pl: Urz±dzenie %s nie jest aktywne.

source: Underlying device for crypt device %s disappeared.
pl: Urzêdzenie stoj±ce za urz±dzeniem szyfrowanym %s znik³o.

source: Invalid plain crypt parameters.
pl: B³êdne parametry szyfru plain.

source: Invalid key size.
pl: B³êdny rozmiar klucza.

source: UUID is not supported for this crypt type.
pl: UUID nie jest obs³ugiwany dla tego rodzaju szyfrowania.

source: Can't format LUKS without device.
pl: Nie mo¿na sformatowaæ LUKS-a bez urz±dzenia.

source: Cannot format device %s which is still in use.
pl: Nie mo¿na sformatowaæ urz±dzenia %s, które jest nadal w u¿yciu.

source: Cannot format device %s, permission denied.
pl: Nie mo¿na sformatowaæ urz±dzenia %s, brak uprawnieñ.

source: Cannot wipe header on device %s.
pl: Nie mo¿na wyczy¶ciæ nag³ówka na urz±dzeniu %s.

source: Can't format LOOPAES without device.
pl: Nie mo¿na sformatowaæ urz±dzenia LUKSAES bez urz±dzenia.

source: Can't format VERITY without device.
pl: Nie mo¿na sformatowaæ VERITY bez urz±dzenia.

source: Unsupported VERITY hash type %d.
pl: Nieobs³ugiwany typ hasza VERITY %d.

source: Unsupported VERITY block size.
pl: Nieobs³ugiwany rozmiar bloku VERITY.

source: Unsupported VERITY hash offset.
pl: Nieobs³ugiwany offset hasza VERITY.

source: Unknown crypt device type %s requested.
pl: Nieznany typ ¿±danego urz±dzenia szyfruj±cego %s.

source: Do you really want to change UUID of device?
pl: Czy na pewno zmieniæ UUID urz±dzenia?

source: This operation is supported only for LUKS device.
pl: Ta operacja jest obs³ugiwana tylko na urz±dzeniach LUKS.

source: Volume %s is not active.
pl: Wolumen %s nie jest aktywny.

source: Volume %s is already suspended.
pl: Wolumen %s ju¿ zosta³ wstrzymany.

source: Suspend is not supported for device %s.
pl: Wstrzymywanie nie jest obs³ugiwane dla urz±dzenia %s.

source: Error during suspending device %s.
pl: B³±d podczas wstrzymywania urz±dzenia %s.

source: Volume %s is not suspended.
pl: Wolumen %s nie jest wstrzymany.

source: Resume is not supported for device %s.
pl: Wznawianie nie jest obs³ugiwane dla urz±dzenia %s.

source: Error during resuming device %s.
pl: B³±d podczas wznawiania urz±dzenia %s.

source: Enter passphrase:
pl: Has³o:

source: Cannot add key slot, all slots disabled and no volume key provided.
pl: Nie mo¿na dodaæ klucza, wszystkie miejsca na klucze wy³±czone i nie podano klucza wolumenu.

source: Enter any passphrase:
pl: Dowolne has³o:

source: Enter new passphrase for key slot:
pl: Nowe has³o dla klucza:

source: Key slot %d changed.
pl: Klucz numer %d zmieniony.

source: Replaced with key slot %d.
pl: Zast±piono kluczem numer %d.

source: Failed to swap new key slot.
pl: Nie uda³o siê podstawiæ nowego klucza.

source: Volume key does not match the volume.
pl: Klucz wolumenu nie pasuje do wolumenu.

source: Key slot %d is invalid.
pl: Numer klucza %d jest nieprawid³owy.

source: Key slot %d is not used.
pl: Klucz %d nie jest u¿ywany.

source: Device %s already exists.
pl: Urz±dzenie %s ju¿ istnieje.

source: Incorrect volume key specified for plain device.
pl: Podano niew³a¶ciwy klucz wolumenu dla zwyk³ego urz±dzenia.

source: Incorrect root hash specified for verity device.
pl: Podano niew³a¶ciwy hasz g³ówny dla urz±dzenia VERITY.

source: Device type is not properly initialised.
pl: Typ urz±dzenia nie zosta³ w³a¶ciwie zainicjalizowany.

source: Device %s is still in use.
pl: Urz±dzenie %s jest nadal w u¿yciu.

source: Invalid device %s.
pl: B³êdne urz±dzenie %s.

source: Function not available in FIPS mode.
pl: Funkcja nie jest dostêpna w trybie FIPS.

source: Volume key buffer too small.
pl: Bufor klucza wolumenu zbyt ma³y.

source: Cannot retrieve volume key for plain device.
pl: Nie mo¿na odtworzyæ klucza wolumenu dla zwyk³ego urz±dzenia.

source: This operation is not supported for %s crypt device.
pl: Ta operacja nie jest obs³ugiwana dla urz±dzenia szyfruj±cego %s.

source: Dump operation is not supported for this device type.
pl: Operacja zrzutu nie jest obs³ugiwana dla tego rodzaju urz±dzenia.

source: Cannot get process priority.
pl: Nie mo¿na odczytaæ priorytetu procesu.

source: Cannot unlock memory.
pl: Nie mo¿na odblokowaæ pamiêci.

source: Out of memory while reading passphrase.
pl: Brak pamiêci podczas odczytu has³a.

source: Error reading passphrase from terminal.
pl: B³±d podczas odczytu has³a z terminala.

source: Verify passphrase:
pl: Weryfikacja has³a:

source: Passphrases do not match.
pl: Has³a nie zgadzaj± siê.

source: Cannot use offset with terminal input.
pl: Nie mo¿na u¿yæ offsetu, je¶li wej¶ciem jest terminal.

source: Failed to open key file.
pl: Nie uda³o siê otworzyæ pliku klucza.

source: Failed to stat key file.
pl: Nie uda³o siê wykonaæ stat na pliku klucza.

source: Cannot seek to requested keyfile offset.
pl: Nie mo¿na przemie¶ciæ siê do ¿±danego po³o¿enia pliku klucza.

source: Error reading passphrase.
pl: B³±d podczas odczytu has³a.

source: Maximum keyfile size exceeded.
pl: Przekroczono maksymalny rozmiar pliku klucza.

source: Cannot read requested amount of data.
pl: Nie mo¿na odczytaæ ¿±danej ilo¶ci danych.

source: FIPS checksum verification failed.
pl: Weryfikacja sumy kontrolnej FIPS nie powiod³a siê.

source: Running in FIPS mode.
pl: Dzia³anie w trybie FIPS.

source: Device %s doesn't exist or access denied.
pl: Urz±dzenie %s nie istnieje lub dostêp jest zabroniony.

source: Cannot use a loopback device, running as non-root user.
pl: Nie mo¿na u¿yæ urz±dzenia loopback w czasie dzia³ania jako nie-root.

source: Cannot find a free loopback device.
pl: Nie znaleziono wolnego urz±dzenia loopback.

source: Attaching loopback device failed (loop device with autoclear flag is required).
pl: Nie uda³o siê pod³±czyæ urz±dzenia loopback (wymagane urz±dzenie loop z flag± autoclear).

source: Cannot use device %s which is in use (already mapped or mounted).
pl: Nie mo¿na u¿yæ urz±dzenia %s, które jest w u¿yciu (ju¿ podmapowane lub zamontowane).

source: Cannot get info about device %s.
pl: Nie mo¿na uzyskaæ informacji o urz±dzeniu %s.

source: Requested offset is beyond real size of device %s.
pl: ¯±dany offset jest poza rzeczywistym rozmiarem urz±dzenia %s.

source: Device %s has zero size.
pl: Urz±dzenie %s ma zerowy rozmiar.

source: Device %s is too small.
pl: Urz±dzenie %s jest zbyt ma³e.

source: Failed to setup dm-crypt key mapping for device %s. Check that kernel supports %s cipher (check syslog for more info).
pl: Nie uda³o siê ustawiæ odwzorowania klucza dm-crypt dla urz±dzenia %s. Proszê sprawdziæ, czy j±dro obs³uguje szyfr %s (wiêcej informacji w syslogu).

source: Key size in XTS mode must be 256 or 512 bits.
pl: Rozmiar klucza w trybie XTS musi wynosiæ 256 lub 512 bitów.

source: Cannot write to device %s, permission denied.
pl: Nie mo¿na zapisaæ na urz±dzenie %s, brak uprawnieñ.

source: Failed to open temporary keystore device.
pl: Nie uda³o siê otworzyæ urz±dzenia do tymczasowego przechowywania kluczy.

source: Failed to access temporary keystore device.
pl: Nie uda³o siê uzyskaæ dostêpu do urz±dzenia do tymczasowego przechowywania kluczy.

source: Device %s is not a valid LUKS device.
pl: Urz±dzenie %s nie jest prawid³owym urz±dzeniem LUKS.

source: Requested header backup file %s already exists.
pl: ¯±dany plik kopii zapasowej nag³ówka %s ju¿ istnieje.

source: Cannot create header backup file %s.
pl: Nie mo¿na utworzyæ pliku kopii zapasowej nag³ówka %s.

source: Cannot write header backup file %s.
pl: Nie mo¿na zapisaæ pliku kopii zapasowej nag³ówka %s.

source: Backup file doesn't contain valid LUKS header.
pl: Plik kopii zapasowej nie zawiera prawid³owego nag³ówka LUKS.

source: Cannot open header backup file %s.
pl: Nie mo¿na otworzyæ pliku kopii zapasowej nag³ówka %s.

source: Cannot read header backup file %s.
pl: Nie mo¿na odczytaæ pliku kopii zapasowej nag³ówka %s.

source: Data offset or key size differs on device and backup, restore failed.
pl: Offset danych lub rozmiar klucza ró¿ni± siê miêdzy urz±dzeniem a kopi± zapasow±; przywrócenie nie powiod³o siê.

source: Device %s %s%s
pl: Urz±dzenie %s %s%s

source: does not contain LUKS header. Replacing header can destroy data on that device.
pl: nie zawiera nag³ówka LUKS. Nadpisanie nag³ówka mo¿e zniszczyæ dane na tym urz±dzeniu.

source: already contains LUKS header. Replacing header will destroy existing keyslots.
pl: ju¿ zawiera nag³ówek LUKS. Nadpisanie nag³ówka zniszczy istniej±ce klucze.

source: WARNING: real device header has different UUID than backup!
pl: UWAGA: nag³ówek prawdziwego urz±dzenia ma inny UUID ni¿ kopia zapasowa!

source: Cannot open device %s.
pl: Nie mo¿na otworzyæ urz±dzenia %s.

source: Non standard key size, manual repair required.
pl: Niestandardowy rozmiar klucza, wymagana rêczna naprawa.

source: Non standard keyslots alignment, manual repair required.
pl: Niestandardowe wyrównanie kluczy, wymagana rêczna naprawa.

source: Repairing keyslots.
pl: Naprawianie kluczy.

source: Repair failed.
pl: Naprawa nie powiod³a siê.

source: Keyslot %i: offset repaired (%u -> %u).
pl: Klucz %i: naprawiono offset (%u -> %u).

source: Keyslot %i: stripes repaired (%u -> %u).
pl: Klucz %i: naprawiono pasy (%u -> %u).

source: Keyslot %i: bogus partition signature.
pl: Klucz %i: b³êdna sygnatura partycji.

source: Keyslot %i: salt wiped.
pl: Klucz %i: zarodek wyczyszczony.

source: Writing LUKS header to disk.
pl: Zapis nag³ówka LUKS na dysk.

source: Unsupported LUKS version %d.
pl: Nieobs³ugiwana wersja LUKS %d.

source: Requested LUKS hash %s is not supported.
pl: ¯±dany skrót LUKS %s nie jest obs³ugiwany.

source: LUKS keyslot %u is invalid.
pl: Numer klucza LUKS %u jest nieprawid³owy.

source: No known problems detected for LUKS header.
pl: W nag³ówku LUKS nie wykryto ¿adnych znanych problemów.

source: Error during update of LUKS header on device %s.
pl: B³±d podczas uaktualniania nag³ówka LUKS na urz±dzeniu %s.

source: Error re-reading LUKS header after update on device %s.
pl: B³êd podczas ponownego odczytu nag³ówka LUKS po uaktualnieniu na urz±dzeniu %s.

source: Wrong LUKS UUID format provided.
pl: Podano z³y format LUKS UUID.

source: Cannot create LUKS header: reading random salt failed.
pl: Nie mo¿na utworzyæ nag³ówka LUKS: odczyt losowego zarodka nie powiód³ siê.

source: Not compatible PBKDF2 options (using hash algorithm %s).
pl: Niekompatybilne opcje PBKDF2 (przy u¿yciu algorytmu skrótu %s).

source: Cannot create LUKS header: header digest failed (using hash %s).
pl: Nie mo¿na utworzyæ nag³ówka LUKS: uzyskanie skrótu nag³ówka nie powiod³o siê (przy u¿yciu algorytmu %s).

source: Key slot %d active, purge first.
pl: Klucz numer %d jest aktywny, nale¿y go najpierw wyczy¶ciæ.

source: Key slot %d material includes too few stripes. Header manipulation?
pl: Klucz %d zawiera zbyt ma³o pasów. Zmieniony nag³ówek?

source: Key slot %d unlocked.
pl: Klucz numer %d odblokowany.

source: No key available with this passphrase.
pl: Dla tego has³a nie ma dostêpnego klucza.

source: Key slot %d is invalid, please select keyslot between 0 and %d.
pl: Numer klucza %d jest b³êdny, proszê wybraæ numer od 0 do %d.

source: Cannot wipe device %s.
pl: Nie mo¿na wyczy¶ciæ urz±dzenia %s.

source: Detected not yet supported GPG encrypted keyfile.
pl: Wykryto jeszcze nie obs³ugiwany plik klucza szyfrowany GPG.

source: Please use gpg --decrypt <KEYFILE> | cryptsetup --keyfile=- ...
pl: Proszê u¿yæ gpg --decrypt <PLIK-KLUCZA> | cryptsetup --keyfile=- ...

source: Incompatible loop-AES keyfile detected.
pl: Wykryto niekompatybilny plik klucza loop-AES.

source: Kernel doesn't support loop-AES compatible mapping.
pl: J±dro nie obs³uguje odwzorowañ zgodnych z loop-AES.

source: Error reading keyfile %s.
pl: B³±d odczytu pliku klucza %s.

source: Maximum TCRYPT passphrase length (%d) exceeded.
pl: Przekroczono maksymaln± d³ugo¶æ has³a TCRYPT (%d).

source: PBKDF2 hash algorithm %s not available, skipping.
pl: Algorytm skrótu PBKDF2 %s nie jest dostêpny, pominiêto.

source: Required kernel crypto interface not available.
pl: Wymagany interfejs kryptograficzny j±dra nie jest dostêpny.

source: Ensure you have algif_skcipher kernel module loaded.
pl: Proszê upewniæ siê, ¿e modu³ j±dra algif_skcipher zosta³ za³adowany.

source: Activation is not supported for %d sector size.
pl: Aktywacja nie jest obs³ugiwana dla rozmiaru sektora %d.

source: Kernel doesn't support activation for this TCRYPT legacy mode.
pl: J±dro nie obs³uguje aktywacji dla tego starego trybu TCRYPT.

source: Kernel doesn't support plain64 IV.
pl: J±dro nie obs³uguje IV plain64.

source: This function is not supported without TCRYPT header load.
pl: Ta funkcja nie jest obs³ugiwana bez za³adowanego nag³ówka TCRYPT.

source: Verity device doesn't use on-disk header.
pl: Urz±dzenie VERITY nie u¿ywa nag³ówka na dysku.

source: Device %s is not a valid VERITY device.
pl: Urz±dzenie %s nie jest prawid³owym urz±dzeniem VERITY.

source: Unsupported VERITY version %d.
pl: Nieobs³ugiwana wersja VERITY %d.

source: VERITY header corrupted.
pl: Uszkodzony nag³ówek VERITY.

source: Wrong VERITY UUID format provided.
pl: Podano z³y format UUID-a VERITY.

source: Error during update of verity header on device %s.
pl: B³±d podczas uaktualniania nag³ówka VERITY na urz±dzeniu %s.

source: Kernel doesn't support dm-verity mapping.
pl: J±dro nie obs³uguje odwzorowañ dm-verity.

source: Verity device detected corruption after activation.
pl: Urz±dzenie VERITY wykry³o uszkodzenie po uaktywnieniu.

source: Spare area is not zeroed at position %<PRIu64>.
pl: Nie wyzerowane miejsce zapasowe na pozycji %<PRIu64>.

source: Device offset overflow.
pl: Przepe³nienie offsetu urz±dzenia.

source: Verification failed at position %<PRIu64>.
pl: Weryfikacja nie powiod³a siê na pozycji %<PRIu64>.

source: Invalid size parameters for verity device.
pl: B³êdne parametry rozmiaru dla urz±dzenia VERITY.

source: Too many tree levels for verity volume.
pl: Za du¿o poziomów drzewa dla wolumenu VERITY.

source: Verification of data area failed.
pl: Weryfikacja obszaru danych nie powiod³a siê.

source: Verification of root hash failed.
pl: Weryfikacja g³ównego hasza nie powiod³a siê.

source: Input/output error while creating hash area.
pl: B³±d wej¶cia/wyj¶cia podczas tworzenia obszaru haszy.

source: Creation of hash area failed.
pl: Tworzenie obszaru haszy nie powiod³o siê.

source: WARNING: Kernel cannot activate device if data block size exceeds page size (%u).
pl: UWAGA: J±dro nie mo¿e uaktywniæ urz±dzenia, je¶li rozmiar bloku danych przekracza rozmiar strony (%u).

source: Can't do passphrase verification on non-tty inputs.
pl: Nie mo¿na wykonaæ weryfikacji has³a, je¶li wej¶ciem nie jest terminal.

source: Ignoring keyfile offset and size options, keyfile read size is always the same as encryption key size.
pl: Zignorowano opcje offsetu i rozmiaru pliku klucza, czytany rozmiar jest zawsze taki sam, jak rozmiar klucza szyfrowania.

source: No known cipher specification pattern detected.
pl: Nie wykryto znanego wzorca okre¶laj±cego szyfr.

source: Option --key-file is required.
pl: Wymagana jest opcja --key-file.

source: No device header detected with this passphrase.
pl: Nie wykryto nag³ówka urz±dzenia z tym has³em.

source: Header dump with volume key is sensitive information which allows access to encrypted partition without passphrase. This dump should be always stored encrypted on safe place.
pl: Zrzut nag³ówka z kluczem wolumenu jest informacj± wra¿liw±, pozwalaj±c± na dostêp do zaszyfrowanej partycji bez has³a. Zrzut ten powinien byæ zawsze zapisywany w postaci zaszyfrowanej w bezpiecznym miejscu.

source: # Tests are approximate using memory only (no storage IO).
pl: # Testy s± przybli¿one tylko z u¿yciem pamiêci (bez we/wy na dysk).

source: # Algorithm | Key | Encryption | Decryption
pl: # Algorytm | Klucz | Szyfrowanie | Odszyfrowywanie

source: Cipher %s is not available.
pl: Szyfr %s nie jest dostêpny.

source: N/A
pl: N/D

source: Cannot read keyfile %s.
pl: Nie mo¿na odczytaæ pliku klucza %s.

source: Cannot read %d bytes from keyfile %s.
pl: Nie mo¿na odczytaæ %d bajtów z pliku klucza %s.

source: Really try to repair LUKS device header?
pl: Naprawdê próbowaæ naprawiæ nag³ówek urz±dzenia LUKS?

source: This will overwrite data on %s irrevocably.
pl: To nieodwo³alnie nadpisze dane na %s.

source: memory allocation error in action_luksFormat
pl: b³±d przydzielania pamiêci w action_luksFormat

source: Cannot use %s as on-disk header.
pl: Nie mo¿na u¿yæ %s jako nag³ówka na dysku.

source: Reduced data offset is allowed only for detached LUKS header.
pl: Offset zmniejszonych danych jest dozwolony tylko dla osobnego nag³ówka LUKS.

source: Key slot %d selected for deletion.
pl: klucz %d wybrany do usuniêcia.

source: Key %d not active. Can't wipe.
pl: Klucz %d nie jest aktywny. Nie mo¿na wyczy¶ciæ.

source: This is the last keyslot. Device will become unusable after purging this key.
pl: To jest ostatni klucz. Urz±dzenie stanie siê bezu¿yteczne po usuniêciu tego klucza.

source: Enter any remaining passphrase:
pl: Dowolne pozosta³e has³o:

source: Enter passphrase to be deleted:
pl: Has³o do usuniêcia:

source: Enter any existing passphrase:
pl: Dowolne istniej±ce has³o:

source: Enter passphrase to be changed:
pl: Has³o, które ma byæ zmienione:

source: Enter new passphrase:
pl: Nowe has³o:

source: Option --header-backup-file is required.
pl: Wymagana jest opcja --header-backup-file.

source: Unrecognized metadata device type %s.
pl: Nie rozpoznany typ urz±dzenia metadanych %s.

source: Command requires device and mapped name as arguments.
pl: Polecenie wymaga urz±dzenia i nazwy odwzorowywanej jako argumentów.

source: <device> [--type <type>] [<name>]
pl: <uz±dzenie> [--type <typ>] [<nazwa>]

source: open device as mapping <name>
pl: otwarcie urz±dzenia jako odwzorowania <nazwa>

source: <name>
pl: <nazwa>

source: close device (remove mapping)
pl: zamkniêcie urz±dzenia (usuniêcie odwzorowania)

source: resize active device
pl: zmiana rozmiaru aktywnego urz±dzenia

source: show device status
pl: pokazanie stanu urz±dzenia

source: benchmark cipher
pl: test szybko¶ci szyfru

source: <device>
pl: <urz±dzenie>

source: try to repair on-disk metadata
pl: próba naprawy metadanych na dysku

source: <device> [<new key file>]
pl: <urz±dzenie> [<nowy plik klucza>]

source: formats a LUKS device
pl: sformatowanie urz±dzenia LUKS

source: add key to LUKS device
pl: dodanie klucza do urz±dzenia LUKS

source: <device> [<key file>]
pl: <urz±dzenie> [<plik klucza>]

source: removes supplied key or key file from LUKS device
pl: usuniêcie podanego klucza lub pliku klucza z urz±dzenia LUKS

source: changes supplied key or key file of LUKS device
pl: zmiana podanego klucza lub pliku klucza urz±dzenia LUKS

source: <device> <key slot>
pl: <urz±dzenie> <numer klucza>

source: wipes key with number <key slot> from LUKS device
pl: wyczyszczenie klucza o numerze <numer klucza> z urz±dzenia LUKS

source: print UUID of LUKS device
pl: wypisanie UUID-a urz±dzenia LUKS

source: tests <device> for LUKS partition header
pl: sprawdzenie <urz±dzenia> pod k±tem nag³ówka partycji LUKS

source: dump LUKS partition information
pl: zrzut informacji o partycji LUKS

source: dump TCRYPT device information
pl: zrzut informacji o urz±dzeniu TCRYPT

source: Suspend LUKS device and wipe key (all IOs are frozen).
pl: Wstrzymanie urz±dzenia LUKS i wyczyszczenie klucza (zamra¿a wszystkie operacje we/wy).

source: Resume suspended LUKS device.
pl: Wznowienie zatrzymanego urz±dzenia LUKS.

source: Backup LUKS device header and keyslots
pl: Kopia zapasowa nag³ówka i kluczy urz±dzenia LUKS

source: Restore LUKS device header and keyslots
pl: Odtworzenie nag³ówka i kluczy urz±dzenia LUKS z kopii zapasowej

source: <action> is one of:
pl: <akcja> to jedno z:

source: You can also use old <action> syntax aliases: open: create (plainOpen), luksOpen, loopaesOpen, tcryptOpen close: remove (plainClose), luksClose, loopaesClose, tcryptClose
pl: Mo¿na tak¿e u¿ywaæ starych aliasów sk³adni <akcja>: open: create (plainOpen), luksOpen, loopaesOpen, tcryptOpen close: remove (plainClose), luksClose, loopaesClose, tcryptClose

source: <name> is the device to create under %s <device> is the encrypted device <key slot> is the LUKS key slot number to modify <key file> optional key file for the new key for luksAddKey action
pl: <nazwa> to urz±dzenie do utworzenia wewn±trz %s <urz±dzenie> to zaszyfrowane urz±dzenie <numer klucza> to numer klucza LUKS do zmiany <plik klucza> to opcjonalny plik nowego klucza dla akcji luksAddKey

source: Default compiled-in key and passphrase parameters: Maximum keyfile size: %dkB, Maximum interactive passphrase length %d (characters) Default PBKDF2 iteration time for LUKS: %d (ms)
pl: Domy¶lne wkompilowane parametry kluczy i hase³: Maksymalny rozmiar pliku klucza: %dkB, maksymalna d³ugo¶æ has³a interaktywnego %d (znaków) Domy¶lny czas iteracji PBKDF2 dla LUKS: %d (ms)

source: Default compiled-in device cipher parameters: loop-AES: %s, Key %d bits plain: %s, Key: %d bits, Password hashing: %s LUKS1: %s, Key: %d bits, LUKS header hashing: %s, RNG: %s
pl: Domy¶lne wkompilowane parametry szyfrowania urz±dzeñ: loop-AES: %s, bitów klucza: %d plain: %s, bitów klucza: %d, skrót has³a: %s LUKS1: %s, bitów klucza: %d, skrót nag³ówka LUKS: %s, RNG: %s

source: %s: requires %s as arguments
pl: %s: wymaga %s jako argumentów

source: Show this help message
pl: Wy¶wietlenie tego opisu

source: Display brief usage
pl: Wy¶wietlenie krótkiej informacji o sk³adni

source: Help options:
pl: Opcje pomocnicze:

source: Print package version
pl: Wypisanie wersji pakietu

source: Shows more detailed error messages
pl: Wy¶wietlanie bardziej szczegó³owych komunikatów b³êdów

source: Show debug messages
pl: Wy¶wietlanie informacji diagnostycznych
